In [2]:
#Question 1- How to import pandas and check the version?
#import pandas library with 'pd' alias name
import pandas as pd
print(pd.__version__)

1.1.4

In [6]:
#Question 2- How to create a series from a numpy array?
import numpy as np
arr = np.array([10, 20, 30, 40, 50])
print("NumPy array:",arr)
pandaSeries = pd.Series(arr)
#pandaSeries = pd.Series(arr,index=range(1,6))    # can use index parameter of Series function to give user defined indexes
print("\nNumpy Array Converted Pandas series:\n",pandaSeries,sep="")

NumPy array: [10 20 30 40 50]

Numpy Array Converted Pandas series:
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [15]:
#Question 3- How to convert the index of a series into a column of a dataframe?
ser=pd.Series([89,77,66,94,81],name="scores")   #series
df=ser.reset_index()   #converted to dataframe df
df

   index  scores
0      0      89
1      1      77
2      2      66
3      3      94
4      4      81

In [29]:
#Question 4- Write the code to list all the datasets available in seaborn library.
#            Load the 'mpg' dataset
#            Note: mpg dataset will be read from seaborn module in the manner sir has already shown(provided in the
#            materials folder)

import seaborn as sns
#Listing the datasets available in seaborn library
print("No. of DataSets:",len(sns.get_dataset_names()))
print("Seaborn DataSets:\n",sns.get_dataset_names())
print()

## Loading the mpg dataset
mpg_data=sns.load_dataset('mpg')
mpg_data.head()

No. of DataSets: 18
Seaborn DataSets:
 ['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'exercise', 'flights', 'fmri', 'gammas', 'geyser', 'iris', 'mpg', 'penguins', 'planets', 'tips', 'titanic']

    mpg  cylinders  displacement  ...  model_year  origin                       name
0  18.0          8         307.0  ...          70     usa  chevrolet chevelle malibu
1  15.0          8         350.0  ...          70     usa          buick skylark 320
2  18.0          8         318.0  ...          70     usa         plymouth satellite
3  16.0          8         304.0  ...          70     usa              amc rebel sst
4  17.0          8         302.0  ...          70     usa                ford torino

[5 rows x 9 columns]

In [32]:
#Question 5- Which country origin cars are a part of this dataset?
mpg_df = pd.DataFrame(mpg_data)

#Origin country of cars
print("Origin country of cars:",mpg_df.origin.unique())

Origin country of cars: ['usa' 'japan' 'europe']

In [34]:
#Question 6- Extract the part of the dataframe which contains cars belonging to 'usa'
mpg_usa=mpg_df[mpg_df["origin"]=='usa']
mpg_usa

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
392  27.0          4  ...     usa           chevrolet camaro
393  27.0          4  ...     usa            ford mustang gl
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[249 rows x 9 columns]